Grasshopper.Folders.AppDataFolder
Gets the appdata folder for Grasshopper. This folder is defined as %appdata%\Grasshopper\
and the physical uri may differ depending on Windows version.

Grasshopper.Folders.DefaultAssemblyFolderVersion6
Gets the standard directory in windows ApplicationData that contains 3rd party GHA files.
Returns: A directory path.