Grasshopper.GUI.Script.GH_ScriptEditor
Script editor window.

Grasshopper.GUI.Script.GH_ScriptEditor.#ctor(Grasshopper.GUI.Script.GH_ScriptLanguage)
Create a new script editor unassociated with any document object.

Grasshopper.GUI.Script.GH_ScriptEditor.#ctor(Grasshopper.GUI.Script.GH_ScriptLanguage,Grasshopper.Kernel.IGH_DocumentObject)
Create a new script editor which is associated with a document object.
owner: Document object which owns this script editor.

Grasshopper.GUI.Script.GH_ScriptEditor.Document
Gets the document currently loaded into the Code Editor control.

Grasshopper.GUI.Script.GH_ScriptEditor.SetSourceCode(Grasshopper.GUI.Script.GH_CodeBlocks)
Set the source contents of the ScriptEditor window.
code: Source code to assign.

Grasshopper.GUI.Script.GH_ScriptEditor.GetSourceCode
Gets the source contents of the ScriptEditor window.
Returns: The content of the Script editor.