Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiElement.AlignLeft
Align Content Left button.

Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiElement.AlignCenter
Align Content Center button.

Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiElement.AlignRight
Align Content Right button.

Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiElement.DecreaseFont
Smaller Font button.

Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiElement.IncreaseFont
Larger Font button.

Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiElement.PickFont
Change Font button.

Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiElement.DrawIndices
Toggle Draw Indices button.

Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiElement.DrawPaths
Toggle Draw Paths button.

Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiElement.PickColour
Set Panel Colour button.

Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiElement.Wrap
Wrap items instead of trimming them.

Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiElement.SpecialCodes
Replace special codes with special characters.

Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiElement.Multiline
Use multi-line user text.

Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiElement.MinButtonIndex
Represents the lowest index for all zui buttons.

Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiElement.MaxButtonIndex
Represents the highest index for all zui buttons.