Grasshopper.Kernel.GH_Convert.ToGHSubD_Secondary(System.Object,Grasshopper.Kernel.Types.GH_SubD@)
Converts similar data into a GH_Brep instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Brep will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToMesh_Primary(System.Object,Rhino.Geometry.Mesh@)
Performs a direct cast from OnMesh or GH_Mesh.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An OnMesh instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.GeometryToObjRef(Grasshopper.Kernel.Types.IGH_GeometricGoo)
Create an ObjRef for a referenced IGH_GeometricGoo. Unreferenced
IGH_GeometryGoo will return null
[in]: geometric goo to get an ObjRef from
Returns:
An instance of an ObjRef when the goo is referenced geometry.
It is up to the caller to Dispose of the objref when it is no
longer needed
Null for unreferenced geometry