Grasshopper.Kernel.GH_DocumentRenderMeshProvider.Document
Gets the currently relevant document.

Grasshopper.Kernel.GH_DocumentRenderMeshProvider.PreviewObjects
Iterate over all relevant GH_CustomPreviewComponent in the current document.
Relevant means; enabled, rendering and a valid clippingbox.